In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("datasets/titanic_data.csv")
print(df.shape)
df.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
for col in df.columns:
    if any(df[col].isnull()):
        num_missing = sum(df[col].isnull())
        print("feature %s, missing %i entries (%.2f%%)"
              %(col, num_missing, 100 * num_missing / len(df)))
    else:
        print("feature %s has no missing value"%col)

feature Age, missing 177 entries (19.87%)
feature Cabin, missing 687 entries (77.10%)
feature Embarked, missing 2 entries (0.22%)

#### Drop rows that contain any null

In [4]:
df.dropna(axis=0, how='any').shape

(183, 12)

#### Drop rows that have particular columns set to null

In [5]:
df.dropna(subset=["Age"]).shape

(714, 12)

#### Drop entire column

In [6]:
df.drop("Age", axis=1).shape

(891, 11)

In [7]:
df.drop(["Age"], axis=1).shape

(891, 11)